__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 224, 224, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 224, 224, 64) 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 112, 112, 64) 0           block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 112, 112, 128 73856       block1_pool[0][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 112, 112, 128 147584      block2_conv1[0][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 56, 56, 128)  0           block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 56, 56, 256)  295168      block2_pool[0][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv2[0][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 28, 28, 256)  0           block3_conv3[0][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 28, 28, 512)  1180160     block3_pool[0][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv1[0][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv2[0][0]               
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, 14, 14, 512)  0           block4_conv3[0][0]               
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, 14, 14, 512)  2359808     block4_pool[0][0]                
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv1[0][0]               
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv2[0][0]               
__________________________________________________________________________________________________
block5_pool (MaxPooling2D)      (None, 7, 7, 512)    0           block5_conv3[0][0]               
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 7, 7, 512)    262656      block5_pool[0][0]                
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 7, 7, 512)    0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 14, 14, 512)  2359808     leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 14, 14, 512)  0           conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 14, 14, 1024) 0           leaky_re_lu_2[0][0]              
                                                                 block5_conv3[0][0]               
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 512)  524800      concatenate_1[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 14, 14, 512)  0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 28, 28, 512)  2359808     leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 28, 28, 512)  0           conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 28, 28, 1024) 0           leaky_re_lu_4[0][0]              
                                                                 block4_conv3[0][0]               
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 28, 28, 512)  524800      concatenate_2[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 28, 28, 512)  0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 56, 56, 256)  1179904     leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 56, 56, 256)  0           conv2d_transpose_3[0][0]         
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 56, 56, 512)  0           leaky_re_lu_6[0][0]              
                                                                 block3_conv3[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 56, 56, 256)  131328      concatenate_3[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 56, 56, 256)  0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 112, 112, 128 295040      leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 112, 112, 128 0           conv2d_transpose_4[0][0]         
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 112, 112, 256 0           leaky_re_lu_8[0][0]              
                                                                 block2_conv2[0][0]               
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 112, 112, 128 32896       concatenate_4[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 112, 112, 128 0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 224, 224, 64) 73792       leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 224, 224, 64) 0           conv2d_transpose_5[0][0]         
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 224, 224, 128 0           leaky_re_lu_10[0][0]             
                                                                 block1_conv2[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 224, 224, 64) 8256        concatenate_5[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 224, 224, 64) 0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 224, 224, 3)  195         leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 224, 224, 3)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 224, 224, 6)  0           leaky_re_lu_12[0][0]             
                                                                 input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 224, 224, 3)  21          concatenate_6[0][0]              
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 224, 224, 3)  0           conv2d_8[0][0]                   
==================================================================================================
Total params: 22,467,992
Trainable params: 13,247,512
Non-trainable params: 9,220,480
__________________________________________________________________________________________________
