(100, 224, 224, 3)
(100, 224, 224, 3)
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 28, 28, 256)       1179904   
_________________________________________________________________
batch_normalization_1 (Batch (None, 28, 28, 256)       1024      
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 56, 56, 128)       295040    
_________________________________________________________________
batch_normalization_2 (Batch (None, 56, 56, 128)       512       
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 112, 112, 64)      73792     
_________________________________________________________________
batch_normalization_3 (Batch (None, 112, 112, 64)      256       
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 224, 224, 32)      18464     
_________________________________________________________________
batch_normalization_4 (Batch (None, 224, 224, 32)      128       
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 224, 224, 3)       99        
_________________________________________________________________
batch_normalization_5 (Batch (None, 224, 224, 3)       12        
=================================================================
Total params: 16,283,919
Trainable params: 3,928,073
Non-trainable params: 12,355,846
_________________________________________________________________
Train on 80 samples, validate on 20 samples
Epoch 1/10
 - 12s - loss: 1.1804 - psnr: -7.0930e-01 - val_loss: 1.9052 - val_psnr: -2.7994e+00
Epoch 2/10
 - 2s - loss: 1.0049 - psnr: -2.1118e-02 - val_loss: 3.0429 - val_psnr: -4.8329e+00
Epoch 3/10
 - 2s - loss: 0.9261 - psnr: 0.3382 - val_loss: 1.9855 - val_psnr: -2.9788e+00
Epoch 4/10
 - 2s - loss: 0.8885 - psnr: 0.5142 - val_loss: 1.9810 - val_psnr: -2.9688e+00
Epoch 5/10
 - 2s - loss: 0.8583 - psnr: 0.6648 - val_loss: 1.6840 - val_psnr: -2.2635e+00
Epoch 6/10
 - 2s - loss: 0.8348 - psnr: 0.7878 - val_loss: 1.2976 - val_psnr: -1.1313e+00
Epoch 7/10
 - 2s - loss: 0.8114 - psnr: 0.9094 - val_loss: 1.2966 - val_psnr: -1.1281e+00
Epoch 8/10
 - 2s - loss: 0.7895 - psnr: 1.0282 - val_loss: 1.2310 - val_psnr: -9.0267e-01
Epoch 9/10
 - 2s - loss: 0.7660 - psnr: 1.1584 - val_loss: 0.9729 - val_psnr: 0.1195
Epoch 10/10
 - 2s - loss: 0.7535 - psnr: 1.2294 - val_loss: 0.9512 - val_psnr: 0.2171
(1, 224, 224, 3)
